In [1]:
#  pandas --> 
import pandas as pd

In [11]:
series1=pd.Series([1,2,3,4,5,6,7,8,9])
print(series1)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [9]:
series1.index

RangeIndex(start=0, stop=9, step=1)

In [12]:
series2=pd.Series([1,2,3,4,5],index=["a","b","c","d","e"])
print(series2)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [14]:
series2.max()

50

In [16]:
series2.idxmax()

'a'

In [13]:
series2['a']=50
print(series2)

a    50
b     2
c     3
d     4
e     5
dtype: int64

In [3]:
pd.Series(["A","B","C"])

0    A
1    B
2    C
dtype: object

In [4]:
pd.Series(["A",2,"&"])

0    A
1    2
2    &
dtype: object

In [6]:
seriesd=pd.Series({"A":[1,2],"B":[3,4]})

In [7]:
seriesd.index

Index(['A', 'B'], dtype='object')

In [17]:
## dataframes--->combination of several individual series

In [23]:
df1=pd.DataFrame({"ProductId":[10,20,30],"Pname":(1,2,3),"Pval":[1,2,3]})
print(df1)

   ProductId  Pname  Pval
0         10      1     1
1         20      2     2
2         30      3     3

In [24]:
df1

   ProductId  Pname  Pval
0         10      1     1
1         20      2     2
2         30      3     3

In [27]:
pid=pd.Series([10,20,30])
pname=pd.Series(['A','B','C'])
pval=pd.Series([200,300,500])
df2=pd.DataFrame({"P_id":pid,"P_name":pname,"P_val":pval})
df2

   P_id P_name  P_val
0    10      A    200
1    20      B    300
2    30      C    500

In [32]:
df3=pd.DataFrame({"P_id":pid,"P_name":pname,"P_val":pval})

df3

   P_id P_name  P_val
0    10      A    200
1    20      B    300
2    30      C    500

In [37]:
print(df3.columns)
df3.columns=("id", "name","val")
print(df3.columns)

Index(['P_id', 'P_name', 'P_val'], dtype='object')
Index(['id', 'name', 'val'], dtype='object')

In [34]:
df4=pd.DataFrame([["product1",4545],["product2",45468]])
df4

          0      1
0  product1   4545
1  product2  45468

In [38]:
df5=pd.DataFrame([["product1",4545],["product2",45468]],index=["A","B"],columns=["col1","col2"])
df5

       col1   col2
A  product1   4545
B  product2  45468

In [42]:
ds1=pd.read_csv("C:\\Users\miles\\Documents\\GitHub\\Training_futurense\\Python\\numpy_pandas\\pandas\\countries of the world.csv")
ds1.head(3)

,Country,Region,Population,Area (sq. mi.),Pop. Density (per sq. mi.),Coastline (coast/area ratio),Net migration,Infant mortality (per 1000 births),GDP ($ per capita),Literacy (%),Phones (per 1000),Arable (%),Crops (%),Other (%),Climate,Birthrate,Deathrate,Agriculture,Industry,Service
0,Afghanistan,ASIA (EX. NEAR EAST),31056997,647500,"48,0","0,00","23,06","163,07",700.0,"36,0","3,2","12,13","0,22","87,65",1,"46,6","20,34","0,38","0,24","0,38"
1,Albania,EASTERN EUROPE,3581655,28748,"124,6","1,26","-4,93","21,52",4500.0,"86,5","71,2","21,09","4,42","74,49",3,"15,11","5,22","0,232","0,188","0,579"
2,Algeria,NORTHERN AFRICA,32930091,2381740,"13,8","0,04","-0,39",31,6000.0,"70,0","78,1","3,22","0,25","96,53",1,"17,14","4,61","0,101","0,6","0,298"

In [43]:
ds2=pd.read_csv("C:\\Users\miles\\Documents\\GitHub\\Training_futurense\\Python\\numpy_pandas\\pandas\\countries of the world.csv",usecols=["Country","Region"])
ds2.head(3)

        Country                               Region
0  Afghanistan         ASIA (EX. NEAR EAST)
1      Albania   EASTERN EUROPE
2      Algeria   NORTHERN AFRICA

In [44]:
type(ds2)

pandas.core.frame.DataFrame

In [47]:
ds3=pd.read_csv("C:\\Users\miles\\Documents\\GitHub\\Training_futurense\\Python\\numpy_pandas\\pandas\\countries of the world.csv",usecols=["Country"]).squeeze()
type(ds3)

pandas.core.series.Series